IDEA Open Model
OpenModel Class
 Open model
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.OpenModel
 Namespace: IdeaRS.OpenModel
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 10.0.1.1 (10.0.1.1)
Syntax
public class OpenModel
Public Class OpenModel
public ref class OpenModel
The OpenModel type exposes the following members.
Constructors
Name | Description
OpenModel
 Constructor
Top
Properties
Name | Description
ArcSegment3D
 List of ArcSegment3D
Attribute
 List of attributes
Beam
 List of Elements 1D
CombiInput
 List of Combinations
ConcreteCheckSection
 List of the concrete check section
ConcreteSetup
 Gets or sets the concrete member data
ConnectionPoint
 List of Connection Points
Connections
 List of Connection data
ConnectionSetup
 Information about Connection Setup
CrossSection
 List of CrossSection
DappedEnd
 List of dapped ends in Detail
Element1D
 List of Elements 1D
Element2D
 List of Elements 2D
HingeElement1D
 List of hinge elements 1D
CheckMember
 List of the Check members
InitialImperfectionOfPoint
 List of InitialmperfectionOfPoint
ISDModel
 List of Details
LineSegment3D
 List of LineSegment3D
LineSupportSegment
 List of Line support on segment
LoadCase
 List of Load cases
LoadGroup
 List of Load groups
LoadsInPoint
 List of point load impulses in this load case
LoadsOnLine
 List of line load impulses in this load case
LoadsOnSurface
 List surafce load in this load case
MatConcrete
 List of MatConcrete
MatPrestressSteel
 List of MatPrestressSteel
MatReinforcement
 List of MatReinforcement
MatSteel
 List of MatSteel
Member1D
 List of Member 1D
Member2D
 List of Member 2D
Opening
 List of openings for Detail
OriginSettings
 Information about origin project
PatchDevice
 List of dapped ends in Detail
Point3D
 List of Point3D
PointLoadsOnLine
 List of point load impulses in this load case
PointOnLine3D
 List of Point on line 3D
PointSupportNode
 List of Point support in node
PolyLine3D
 List of PolyLine3D
ProjectData
 Gets or sets the projet data
ProjectDataConcrete
 Gets or sets the projet data concrete
Region3D
 List of Region3D
ReinforcedCrossSection
 List of Reinforced CrossSection
Reinforcement
 List of reinforcement in IDEA StatiCa Detail
ResultClass
 Result Class
RigidLink
 List of Rigid link
Settlements
 Settlements in this load case
StrainLoadsOnLine
 List of generalized strain load impulses along the line in this load case.
TemperatureLoadsOnLine
 List of temperature load in this load case
Tendon
 Tendon
Version
 Data format version
Wall
 List of Elements 2D
Top
Methods
Name | Description
AddObject(OpenAttribute)
 Add new atribute object into collections
AddObject(OpenElementId)
 Add new object into collections
GetMaxId(String)
 Get max Id value for specified type
GetMaxId(Type)
 Get max Id value for specified type
GetMaxId(OpenElementId)
 Get max Id value for specified type
GetObject
 Gets the Open element object from the Reference element
LoadFromStream
 Creates the instance of Open Model from the stream
LoadFromString
 Creates the instance of Open Model from xml string
LoadFromXmlFile
 Creates the instance of Open Model from the XML file
SaveToXmlFile
 Saves content into file as a XML format
Top
See Also
Reference
IdeaRS.OpenModel Namespace